InformationRegisters/ИА_ЗадачиКЦ.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<InformationRegister>
		<Properties>
			<Name>ИА_ЗадачиКЦ</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Автор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Наименование</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>150</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Дата</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СрокИсполнения</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Пользователь</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Исполнитель</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Пост</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ОргСхема</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДатаВыполнения</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Выполнена</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>ИндКартинки</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>2</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИндКартинкиТипЗадачи</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>2</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИндКартинкиПриоритет</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>2</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>ПользовательКЦ</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Корзина</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ИА_РасширенияКомцентра</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Ссылка</Name>
					<Type>
						<v8:TypeSet>cfg:AnyRef</v8:TypeSet>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/ИА_НовыеЗадачи.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<InformationRegister>
		<Properties>
			<Name>ИА_НовыеЗадачи</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Dimension>
				<Properties>
					<Name>Пользователь</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Задача</Name>
					<Type>
						<v8:TypeSet>cfg:AnyRef</v8:TypeSet>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/ИА_ДанныеФизЛиц.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<InformationRegister>
		<Properties>
			<Name>ИА_ДанныеФизЛиц</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Фото</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ФотоАватар</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ВерсияФото</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Пользователь</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Телефон</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>30</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ЭлектроннаяПочта</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>ФизЛицо</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/ИА_ЗамещениеСотрудников.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<InformationRegister>
		<Properties>
			<Name>ИА_ЗамещениеСотрудников</Name>
			<InformationRegisterPeriodicity>Second</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ДатаНачала</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДатаОкончания</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Пользователь</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Заместитель</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/ИА_АдресацияЗадачПланаДействий.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<InformationRegister>
		<Properties>
			<Name>ИА_АдресацияЗадачПланаДействий</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Dimension>
				<Properties>
					<Name>Пользователь</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Пост</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ОргСхема</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Catalogs/ИА_РасширенияКомцентра.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Catalog>
		<Properties>
			<Name>ИА_РасширенияКомцентра</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ТекстЗапроса</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТабПараметровЗапроса</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

CommonModules/ИА_ОбщиеПроцедуры_Технология_КоммЦентр_Сервер/Ext/Module.bsl
Функция ИА_ПолучитьЗадачуВх() Экспорт
	ОбновитьДанныеКорзины("Входящие");
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	РегистрСведенийИА_ЗадачиКЦ.Ссылка,
	               |	РегистрСведенийИА_ЗадачиКЦ.Наименование
	               |ИЗ
	               |	РегистрСведений.ИА_ЗадачиКЦ КАК РегистрСведенийИА_ЗадачиКЦ
	               |ГДЕ
	               |	РегистрСведенийИА_ЗадачиКЦ.ПользовательКЦ = &ПользовательКЦ
	               |	И РегистрСведенийИА_ЗадачиКЦ.Корзина = ЗНАЧЕНИЕ(Справочник.ИА_РасширенияКомцентра.Входящие)";
	Запрос.УстановитьПараметр("ПользовательКЦ", ПараметрыСеанса.ТекущийПользователь);
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		Стр = Новый Структура("Ссылка, Наименование", Выборка.Ссылка, Выборка.Наименование);
		Возврат Стр;
	Иначе
		возврат неопределено;
	КонецЕсли;
КонецФункции

//
// Возвращает количество задач в корзине
//
Функция ОбновитьДанныеКорзины(Корзина, ТипыЗадач = Неопределено, ТекПольз = Неопределено) Экспорт
	
	Если ТекПольз = Неопределено ТОгда
		ТекПольз = ПараметрыСеанса.ТекущийПользователь;
	КонецЕсли;
	
	Расшир = Справочники.ИА_РасширенияКомцентра[Корзина];
	
	Набор = РегистрыСведений.ИА_ЗадачиКЦ.СоздатьНаборЗаписей();
	Набор.Отбор.ПользовательКЦ.Установить(ТекПольз);
	Набор.Отбор.Корзина.Установить(Расшир);
	
	Запрос = Новый Запрос;
	
	Запрос.Текст = Расшир.ТекстЗапроса;
	Запрос.УстановитьПараметр("ТекущийПользователь", ТекПольз);
	Запрос.УстановитьПараметр("ТекДата", ТекущаяДата());
	Запрос.УстановитьПараметр("Корзина", Расшир);
	парам = Расшир.ТабПараметровЗапроса.Получить();
	Если парам <> Неопределено Тогда
		Для каждого стр из парам Цикл
			Запрос.УстановитьПараметр(стр.ИмяПараметра, стр.Значение);
		КонецЦикла;
	КонецЕсли;
	
	тз = Запрос.Выполнить().Выгрузить();
	ТипыЗадач = тз.Колонки.Ссылка.ТипЗначения.Типы();
	
	// обработка новых задач
	Если Корзина = "Входящие" Тогда
		Запрос.Текст = "ВЫБРАТЬ
		               |	ТЗ.Ссылка
		               |ПОМЕСТИТЬ НовоеСодержимое
		               |ИЗ
		               |	&ТЗ КАК ТЗ
		               |;
		               |
		               |////////////////////////////////////////////////////////////////////////////////
		               |ВЫБРАТЬ
		               |	НовоеСодержимое.Ссылка
		               |ИЗ
		               |	НовоеСодержимое КАК НовоеСодержимое
		               |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ИА_ЗадачиКЦ КАК ИА_ЗадачиКЦ
		               |		ПО (ИА_ЗадачиКЦ.ПользовательКЦ = &ТекущийПользователь)
		               |			И (ИА_ЗадачиКЦ.Корзина = &Корзина)
		               |			И НовоеСодержимое.Ссылка = ИА_ЗадачиКЦ.Ссылка
		               |ГДЕ
		               |	ИА_ЗадачиКЦ.Ссылка ЕСТЬ NULL ";
		Запрос.УстановитьПараметр("тз", тз);
		Новые = Запрос.Выполнить().Выбрать();
		мен = РегистрыСведений.ИА_НовыеЗадачи.СоздатьМенеджерЗаписи();
		Пока Новые.Следующий() Цикл
			мен.Пользователь = ТекПольз;
			мен.Задача = Новые.ссылка;
			мен.Записать();
			
			ОтправитьУведомлениеНаПочту(ТекПольз, Новые.ссылка);
		КонецЦикла;
	КонецЕсли;
	//
	
	Набор.Загрузить(тз);
	Для каждого стр из Набор цикл
		стр.ПользовательКЦ = ТекПольз;
		стр.Корзина = Расшир;
	КонецЦикла;
	
	Набор.Записать(Истина);
	
	Возврат тз.Количество();
КонецФункции

Процедура ОтправитьУведомлениеНаПочту(Пользователь, Задача)
	Если ИА_НастройкиСПИ.ЗначениеНастройки(Пользователь, ПланыВидовХарактеристик.ИА_НастройкиПользователей.ПолучатьУведомленияНаПочту) Тогда
		Запрос = Новый Запрос;
		Запрос.Текст = "ВЫБРАТЬ
						|	ИА_ДанныеФизЛиц.ЭлектроннаяПочта
						|ИЗ
						|	РегистрСведений.ИА_ДанныеФизЛиц КАК ИА_ДанныеФизЛиц
						|ГДЕ
						|	ИА_ДанныеФизЛиц.Пользователь = &Пользователь";
		Запрос.УстановитьПараметр("Пользователь", Пользователь);
		Выборка = Запрос.Выполнить().Выбрать();
		
		ИА_СерверПочты = Константы.ИА_СерверПочты.Получить();
		Если Выборка.Следующий() и СокрЛП(Выборка.ЭлектроннаяПочта)<>"" и ИА_СерверПочты <> "" Тогда
		
			Профиль = новый ИнтернетПочтовыйПрофиль;
			Профиль.АдресСервераSMTP = ИА_СерверПочты;
			Профиль.ПользовательSMTP = Константы.ИА_ПользовательПочты.Получить();
			Профиль.ПарольSMTP = Константы.ИА_ПарольПочты.Получить(); 
			ПРофиль.АутентификацияSMTP = СпособSMTPАутентификации.Login;
			ПРофиль.ИспользоватьSSLSMTP = Константы.ИА_ИспользоватьSSL.Получить();
			
			Сообщение = Новый ИнтернетПочтовоеСообщение;
			Сообщение.Отправитель = Константы.ИА_АдресОтправителя.Получить();
			
			Текст = Задача.Наименование + Символы.ПС + Символы.ПС;
			Если Задача.ЭтоЗРС тогда
				Сообщение.Тема = "КСУ: Новая ЗРС";	
				Текст = Текст + "Ситуация: " + Задача.Ситуация + Символы.ПС + "Данные: "+ Задача.Данные+ Символы.ПС + "Решение: "+ Задача.Содержание;
			ИначеЕсли Задача.ЭтоПослание тогда
				Сообщение.Тема = "КСУ: Новое послание";	
				Текст = Текст + Задача.Содержание;
			Иначе
				Сообщение.Тема = "КСУ: Новая задача";	
				Текст = Текст + Задача.Содержание;
			КонецЕсли;
			Текст = Текст + Символы.ПС+ Символы.ПС + "Автор: " + Задача.Автор;
			
			Сообщение.Получатели.Добавить(Выборка.ЭлектроннаяПочта);
			Сообщение.Тексты.Добавить(Текст);
			
			Почта = Новый ИнтернетПочта;
			Попытка 
				Почта.Подключиться(Профиль);
				Почта.Послать(Сообщение);
			Исключение
				опОш = ОписаниеОшибки();
				Сообщить("Ошибка отправки почты: " + опОш);
			КонецПопытки; 			
		КонецЕсли;
	КонецЕсли;
КонецПроцедуры

Функция ИА_РольДоступна(пРоль) Экспорт
	Возврат РольДоступна(пРоль);
КонецФункции

Функция ИА_ПериодНапоминания() Экспорт
	Возврат Константы.ИА_ПериодНапоминания.Получить();
КонецФункции

Функция ЗамещаемыеПользователи(ТекущийПользователь) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ИА_ЗамещениеСотрудниковСрезПоследних.Пользователь КАК Пользователь,
		|	1 КАК Приоритет
		|ПОМЕСТИТЬ ДоступныеПользователи
		|ИЗ
		|	РегистрСведений.ИА_ЗамещениеСотрудников.СрезПоследних(, Заместитель = &ТекущийПользователь) КАК ИА_ЗамещениеСотрудниковСрезПоследних
		|ГДЕ
		|	(ИА_ЗамещениеСотрудниковСрезПоследних.ДатаНачала <= &ТекДата
		|			ИЛИ ИА_ЗамещениеСотрудниковСрезПоследних.ДатаНачала = ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0))
		|	И (ИА_ЗамещениеСотрудниковСрезПоследних.ДатаОкончания >= &ТекДата
		|			ИЛИ ИА_ЗамещениеСотрудниковСрезПоследних.ДатаОкончания = ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0))
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	&ТекущийПользователь,
		|	0
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ДоступныеПользователи.Пользователь КАК Пользователь,
		|	ДоступныеПользователи.Приоритет КАК Приоритет
		|ИЗ
		|	ДоступныеПользователи КАК ДоступныеПользователи
		|
		|СГРУППИРОВАТЬ ПО
		|	ДоступныеПользователи.Пользователь,
		|	ДоступныеПользователи.Приоритет
		|
		|УПОРЯДОЧИТЬ ПО
		|	Приоритет,
		|	Пользователь";
	
	Запрос.УстановитьПараметр("ТекДата", ТекущаяДата());
	Запрос.УстановитьПараметр("ТекущийПользователь", ТекущийПользователь);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	Массив = Новый Массив;
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		Массив.Добавить(ВыборкаДетальныеЗаписи.Пользователь);
	КонецЦикла;
	
	Возврат Массив;
	
КонецФункции

Функция ЭтоЗадачаПользователя(Ссылка, МПользователей) Экспорт
	Запрос = Новый запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	ИА_АдресацияЗадачПланаДействий.Пост,
	               |	ИА_АдресацияЗадачПланаДействий.Пользователь
	               |ПОМЕСТИТЬ ВТ_ПостыПользователя
	               |ИЗ
	               |	РегистрСведений.ИА_АдресацияЗадачПланаДействий КАК ИА_АдресацияЗадачПланаДействий
	               |ГДЕ
	               |	ИА_АдресацияЗадачПланаДействий.Пользователь В(&МПользователей)
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	ИА_ЗадачаПланаДействий.Ссылка
	               |ПОМЕСТИТЬ ВТ_Задачи
	               |ИЗ
	               |	Задача.ИА_ЗадачаПланаДействий КАК ИА_ЗадачаПланаДействий
	               |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТ_ПостыПользователя КАК ВТ_ПостыПользователя
	               |		ПО ИА_ЗадачаПланаДействий.Пост = ВТ_ПостыПользователя.Пост
	               |ГДЕ
	               |	ИА_ЗадачаПланаДействий.Ссылка = &Ссылка
	               |	И ИА_ЗадачаПланаДействий.Пользователь = ЗНАЧЕНИЕ(Справочник.Пользователи.ПустаяСсылка)
	               |
	               |ОБЪЕДИНИТЬ ВСЕ
	               |
	               |ВЫБРАТЬ
	               |	ИА_ЗадачаПланаДействий.Ссылка
	               |ИЗ
	               |	Задача.ИА_ЗадачаПланаДействий КАК ИА_ЗадачаПланаДействий
	               |ГДЕ
	               |	ИА_ЗадачаПланаДействий.Пользователь В(&МПользователей)
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	ВТ_Задачи.Ссылка
	               |ИЗ
	               |	ВТ_Задачи КАК ВТ_Задачи
	               |ГДЕ
	               |	ВТ_Задачи.Ссылка = &Ссылка";
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	Запрос.УстановитьПараметр("МПользователей", МПользователей);
	
	Выборка = Запрос.Выполнить().Выбрать();
	Возврат Выборка.Следующий();
	
КонецФункции
